## 판다스

## 1)생성 및 조회

In [20]:
import pandas as pd # 판다스 실행

(1)데이터만 생성

In [21]:
#나이 데이터를 시리즈로 생성 
age_list = [24, 31, 26]
data1 = pd.Series(data = [10, 20, 30])
data2 = pd.Series(data = [1, 2, 3])


print(data1 + data2)
print("="50)
print(data1 - data2)
print("="50)
print(data1 * data2)
print("="50)
print(data1 / data2)
print("="50)
print(data1 // data2)

SyntaxError: invalid syntax. Perhaps you forgot a comma? (662420622.py, line 8)

In [ ]:
age_series.dtype

NameError: name 'age_series' is not defined

In [ ]:
age_series.index = ["김영철", "송윤지","임수현"]
age_series

NameError: name 'age_series' is not defined

In [ ]:
age_series2 = pd.Series(
    data = age list 
)

SyntaxError: invalid syntax. Perhaps you forgot a comma? (1260635150.py, line 2)

## 2)연산

In [ ]:
data1 = pd.Series(data=[10, 20, 30])
data2 = pd.Series(data=[1, 2, 3])

data1**data2

0       10
1      400
2    27000
dtype: int64

In [ ]:
#같은 위치는 곧 인덱스다

(1) 결측치 발생

In [ ]:
import pandas as pd 
import numpy as np

myseries = pd.Series([1, np.nan])
myseries

0    1.0
1    NaN
dtype: float64

In [ ]:
data1 = pd.Series(data=[10, 20, 30])
data2 = pd.Series(data=[1, 2, 3, 4])

data1 + data2

0    11.0
1    22.0
2    33.0
3     NaN
dtype: float64

In [ ]:
data1

0    10
1    20
2    30
dtype: int64

In [ ]:
data2 #data2에는 인덱스 3이 있지만 데이터 1에는 없음 여기서 발생하는게 결측치

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
# 예제

# 데이터가 10, 20, 30인 시리즈 생성, 인덱스는 부산, 울산, 대구으로 설정
# 데이터가 1, 2, 3, 4인 시리즈 생성, 인덱스는 광주, 부산, 울산, 대구으로 설정
# 데이터의 덧셈

In [ ]:
data1 = pd.Series(
    data=[10, 20, 30],
    index=["부산", "울산", "대구"]
)
data2 = pd.Series(
    data=[1, 2, 3, 4],
    index=["광주", "부산", "울산", "대구"]
)

data3 = data1 + data2
data3

광주     NaN
대구    34.0
부산    12.0
울산    23.0
dtype: float64

In [ ]:
data3.fillna(999)

광주    999.0
대구     34.0
부산     12.0
울산     23.0
dtype: float64

In [ ]:
data3

광주     NaN
대구    34.0
부산    12.0
울산    23.0
dtype: float64

In [ ]:
data3.dropna()

대구    34.0
부산    12.0
울산    23.0
dtype: float64

## 4) 통계

In [ ]:
# 예제. 문자 데이터

# ['HR', 'Engineering', 'HR', 'Engineering', 'HR', 'Marketing', 'Engineering', 'Marketing', 'HR']
data = pd.Series(
    data = ['HR', 'Engineering', 'HR', 'Engineering', 'HR', 'Marketing', 'Engineering', 'Marketing', 'HR']
)

In [ ]:
data.describe() #freq 는 최빈값 수

count      9
unique     3
top       HR
freq       4
dtype: object

In [ ]:
data = pd.Series(
    data=[10, 20, 30],
    index=["부산", "울산", "대구"]
)

In [ ]:
data = pd.Series(
    data =["복숭아", "사과", "딸기"],
    index = ["부산", "서울", "울산"] ##특산품
)

In [ ]:
print(data.sum())
print(data.min())
print(data.max())
print(data.mean())
print(data.var()) #분산(데이터 - 평균)^2 / 전체 데이터 개수 
print(data.std())  #표준편차 루트(분산)

NameError: name 'data' is not defined

In [ ]:
## 2차원 리스트 
data_list = [
    ["김영철", "M", 24, 179.4],
    ["송윤지", "F", 31, 161.0],
    ["임수현", "F", 26, 174]
]
data = pd.DataFrame(data_list)
data

data.columns= ["이름","성별","나이","키"] #각 열의 타이틀 작성 
data

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [ ]:
# 열에 대한 딕셔너리 
data_dict = {
    "이름": ["김영철", "송윤지", "임수현"],
    "성별": ["M", "F", "F"],
    "나이": [24, 31, 26],
    "키": [179.4, 161.0, 174.0]
}
data = pd.DataFrame(data_dict)
data

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [ ]:
data_list = [
    {"이름": "김영철", "성별": "M", "나이": 24, "키": 179.4},
    {"이름": "송윤지", "성별": "F", "나이": 31, "키": 161.0},
    {"이름": "임수현", "성별": "F", "나이": 26, "키": 174},
]
data = pd.DataFrame(data_list)
data

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [26]:
data_list = [
  {
    "이름": "민지",
    "나이": 24,
    "성별": "F",
    "지역": "서울",
    "전공": "심리학",
    "키(cm)": 163,
    "몸무게(kg)": 54,
    "운동횟수": 3,
    "음주 여부": "아니오",
    "출석률(%)": 96.5
  },
  {
    "이름": "지훈",
    "나이": 27,
    "성별": "M",
    "지역": "부산",
    "전공": "컴퓨터공학",
    "키(cm)": 175,
    "몸무게(kg)": 68,
    "운동횟수": 1,
    "음주 여부": "예",
    "출석률(%)": 89.2
  },
  {
    "이름": "유진",
    "나이": 22,
    "성별": "F",
    "지역": "대전",
    "전공": "디자인",
    "키(cm)": 160,
    "몸무게(kg)": 48,
    "운동횟수": 4,
    "음주 여부": "아니오",
    "출석률(%)": 98.7
  },
  {
    "이름": "수아",
    "나이": 26,
    "성별": "F",
    "지역": "광주",
    "전공": "경영학",
    "키(cm)": 167,
    "몸무게(kg)": 56,
    "운동횟수": 2,
    "음주 여부": "예",
    "출석률(%)": 92.0
  },
  {
    "이름": "현우",
    "나이": 25,
    "성별": "M",
    "지역": "광주",
    "전공": "통계학",
    "키(cm)": 178,
    "몸무게(kg)": 73,
    "운동횟수": 5,
    "음주 여부": "예",
    "출석률(%)": 94.8
  }
]

data = pd.DataFrame(data_list)
data

   이름  나이 성별  지역     전공  키(cm)  몸무게(kg)  운동횟수 음주 여부  출석률(%)
0  민지  24  F  서울    심리학    163       54     3   아니오    96.5
1  지훈  27  M  부산  컴퓨터공학    175       68     1     예    89.2
2  유진  22  F  대전    디자인    160       48     4   아니오    98.7
3  수아  26  F  광주    경영학    167       56     2     예    92.0
4  현우  25  M  광주    통계학    178       73     5     예    94.8

In [27]:
# 이름을 인덱스로 설정해주세요 set_index() data2에 저장
# data2에서 인덱스를 열로 바꿔주세요
# data에서 이름, 전공 열을 조회해주세요
# data2에서 수아 학생의 데이터를 조회해주세요
# data2에서 지훈, 현우 학생의 데이터를 조회해주세요
# data2에서 유진 학생의 음주 여부를 조회해주세요
# data2에서 민지 학생의 키, 몸무게를 조회해주세요
# data에서 성별이 F인 데이터만 조회해주세요
# data에서 키가 170미만이고 출석률이 90% 이상인 데이터를 조회해주세요
# data에서 나이가 25미만이거나 지역이 부산인 데이터를 조회해주세요
# data에서 출석률을 기준으로 내림차순 정렬해주세요

In [28]:
# 이름을 인덱스로 설정해주세요 set_index() data2에 저장
data2 = data.set_index("이름")
data2

    나이 성별  지역     전공  키(cm)  몸무게(kg)  운동횟수 음주 여부  출석률(%)
이름
민지  24  F  서울    심리학    163       54     3   아니오    96.5
지훈  27  M  부산  컴퓨터공학    175       68     1     예    89.2
유진  22  F  대전    디자인    160       48     4   아니오    98.7
수아  26  F  광주    경영학    167       56     2     예    92.0
현우  25  M  광주    통계학    178       73     5     예    94.8

In [29]:
data2.reset_index()

   이름  나이 성별  지역     전공  키(cm)  몸무게(kg)  운동횟수 음주 여부  출석률(%)
0  민지  24  F  서울    심리학    163       54     3   아니오    96.5
1  지훈  27  M  부산  컴퓨터공학    175       68     1     예    89.2
2  유진  22  F  대전    디자인    160       48     4   아니오    98.7
3  수아  26  F  광주    경영학    167       56     2     예    92.0
4  현우  25  M  광주    통계학    178       73     5     예    94.8

In [30]:
# data에서 이름, 전공 열을 조회해주세요
data[["이름", "전공"]]

   이름     전공
0  민지    심리학
1  지훈  컴퓨터공학
2  유진    디자인
3  수아    경영학
4  현우    통계학

In [31]:
# data2에서 수아 학생의 데이터를 조회해주세요
data2.loc["수아",:] # 이때 loc는 행열

나이           26
성별            F
지역           광주
전공          경영학
키(cm)       167
몸무게(kg)      56
운동횟수          2
음주 여부         예
출석률(%)     92.0
Name: 수아, dtype: object

In [32]:
data2.loc["수아",:]

나이           26
성별            F
지역           광주
전공          경영학
키(cm)       167
몸무게(kg)      56
운동횟수          2
음주 여부         예
출석률(%)     92.0
Name: 수아, dtype: object

In [33]:
data2.loc[["수아","지훈"],:]

    나이 성별  지역     전공  키(cm)  몸무게(kg)  운동횟수 음주 여부  출석률(%)
이름
수아  26  F  광주    경영학    167       56     2     예    92.0
지훈  27  M  부산  컴퓨터공학    175       68     1     예    89.2

In [34]:
data.iloc[2, -2]

'아니오'

In [37]:
data2

    나이 성별  지역     전공  키(cm)  몸무게(kg)  운동횟수 음주 여부  출석률(%)
이름
민지  24  F  서울    심리학    163       54     3   아니오    96.5
지훈  27  M  부산  컴퓨터공학    175       68     1     예    89.2
유진  22  F  대전    디자인    160       48     4   아니오    98.7
수아  26  F  광주    경영학    167       56     2     예    92.0
현우  25  M  광주    통계학    178       73     5     예    94.8

In [36]:
data2.loc["민지",["키(cm)", "몸무게(kg)"]]

키(cm)      163
몸무게(kg)     54
Name: 민지, dtype: object

In [ ]:
data2.iloc[0, 4:6]

키(cm)      163
몸무게(kg)     54
Name: 민지, dtype: object

In [ ]:
# data에서 성별이 F인 데이터만 조회해주세요
data.loc[data["성별"]== "F",:]
# data에서 키가 170미만이고 출석률이 90% 이상인 데이터를 조회해주세요
# data에서 나이가 25미만이거나 지역이 부산인 데이터를 조회해주세요
# data에서 출석률을 기준으로 내림차순 정렬해주세요

In [39]:
import requests
import json
import urllib.parse

client_id = "YOUR_CLIENT_ID"
client_secret = "YOUR_CLIENT_SECRET"

url = "https://openapi.naver.com/v1/search/news.json"
headers = {
    "X-Naver-Client-Id": client_id,
    "X-Naver-Client-Secret": client_secret
}

params = {
    "query": "서울 공실률",
    "display": 20,        # 최대 100
    "start": 1,
    "sort": "date"        # 최신순
}

resp = requests.get(url, headers=headers, params=params)
if resp.status_code == 200:
    data = resp.json().get("items", [])
    # 기사 제목, 링크, 요약, 언론사, 날짜 출력
    for i, item in enumerate(data, 1):
        print(f"{i}. {item['title']}\n   {item['link']}\n   {item['description']}\n   {item['pubDate']}\n")
else:
    print("Error", resp.status_code, resp.text)

Error 401 {"errorMessage":"NID AUTH Result Invalid (1000) : Authentication failed. (인증에 실패했습니다.)","errorCode":"024"}

In [ ]:
import os
import sys
import urllib.request
client_id = "DBdbM_wKpuKti7InRNQV"
client_secret = "x2ieUYnR8D"
encText = urllib.parse.quote("공실")
url = "https://openapi.naver.com/v1/search/news?query=" + encText # JSON 결과
# url = "https://openapi.naver.com/v1/search/news.xml?query=" + encText # XML 결과
request = urllib.request.Request(url)
request.add_header("X-Naver-Client-Id",client_id)
request.add_header("X-Naver-Client-Secret",client_secret)
response = urllib.request.urlopen(request)
rescode = response.getcode()
if(rescode==200):
    response_body = response.read()
    print(response_body.decode('utf-8'))
else:
    print("Error Code:" + rescode)